<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"edc85a75d61da9654decbeb2de718b0e51ebdc4a8c829ff66fda7ca3a221e590","plan_job_ref":"Job Run Terraform plan in staging #151 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12717842425","plan_out_hash":"a61e5642e9b1fb03b5f75ce22c5c3c72f4c73514719b2f08d1cc722276f0a1c4","plan_hash":"66c295941e501bd726a17afc327eb83c4c5d1caca2922177ef1648349243417a","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "continuous_monitoring-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "7rVO8grgCr1QdMQiHb0UOMz9ee28jXNQ83miRqELveo=" -> "A/WcgLDIp6yPqNhOcyWKdDGwsJDjS2/klmv92BhW+JY="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-07T16:25:30Z" -> (known after apply)
#        (13 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #151](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12717842425)